# RebarShapeConstraintFixedSegmentDir Class

---
A constraint that can be applied to a RebarShapeSegment and fixes the direction of the segment in UV-space.
SystemObject Autodesk.Revit.DB.StructureRebarShapeConstraint Autodesk.Revit.DB.StructureRebarShapeConstraintFixedSegmentDir
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class RebarShapeConstraintFixedSegmentDir : RebarShapeConstraint

    Public Class RebarShapeConstraintFixedSegmentDir
    	Inherits RebarShapeConstraint

    public ref class RebarShapeConstraintFixedSegmentDir : public RebarShapeConstraint

    type RebarShapeConstraintFixedSegmentDir =
        class
            inherit RebarShapeConstraint
        end
The RebarShapeConstraintFixedSegmentDir type exposes the following members.
| Name| Description
---|---|---
| RebarShapeConstraintFixedSegmentDir|  Create a fixed segment direction constraint.
Top
| Name| Description
---|---|---
| Direction|  The direction of the RebarShapeSegment in UV-space.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from RebarShapeConstraint)
Top
| Name| Description
---|---|---
| Dispose| (Inherited from RebarShapeConstraint)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetParamId|  Return the Id of the parameter associated with this constraint. (Inherited from RebarShapeConstraint)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Structure Namespace